app/controllers/admins_controller.rb

    def index
        admins = Admin.all
---
SELECT "admins".* FROM "admins"

     def update
        admins = Admin.find_by(params[:id])
        admins.update!(admin_params)
---
SELECT "admins".* FROM "admins" WHERE (7) LIMIT ?  [["LIMIT", 1]]
UPDATE "admins" SET "username" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["username", "Beryl"], ["updated_at", "2023-01-22 07:27:56.281504"], ["id", 7]]

    def create
        admins = Admin.create!(admin_params)
---
INSERT INTO "admins" ("username", "email", "password_digest", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)