app/controllers/bookings_controller.rb

    def index
        render json: Booking.all, status: :ok
---
SELECT "bookings".* FROM "bookings"

    def show
        booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

    def create
        booking = Booking.create!(booking_params)
---
INSERT INTO "bookings" ("from", "to", "date", "price", "client_id", "bus_id", "no_of_passangers", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
        booking = Booking.find(params[:id])
        booking.update!(booking_params)
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "bookings" SET "from" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["from", "Bondo"], ["updated_at", "2023-01-22 07:20:27.311678"], ["id", 7]]