app/controllers/buses_controller.rb

INSERT INTO "buses" ("number_plate", "fleet_no", "route_id", "driver_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["number_plate", "kdb173a"], ["fleet_no", "08856"], ["route_id", 11], ["driver_id", 7], ["created_at", "2023-01-16 13:24:44.522307"], ["updated_at", "2023-01-16 13:24:44.522307"]]
---
    def create
        bus = buses.create!(bus_params)

SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
            def driver
                @driver ||= Driver.find(params[:driver_id])