app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients"
---
    def index
        render json: Client.all, status: :ok

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "clients" SET "username" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["username", "Johnnn"], ["updated_at", "2023-01-22 07:17:29.021441"], ["id", 7]]
---
    def update
        client = Client.find_by(id: params[:id])
        client.update!(client_params)

INSERT INTO "clients" ("username", "email", "password_digest", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
     def create
        client = Client.create!(client_params)