app/controllers/drivers_controller.rb

    def index
       drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

    def update
        driver = Driver.find_by(id: params[:id])
        driver.update!(driver_params)
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "drivers" SET "username" = ?, "updated_at" = ? WHERE "drivers"."id" = ?  [["username", "Johnnn"], ["updated_at", "2023-01-22 07:13:29.008881"], ["id", 10]]

    def create
        driver = Driver.create!(driver_params)
---
INSERT INTO "drivers" ("username", "email", "password_digest", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)