app/controllers/routes_controller.rb

SELECT "routes".* FROM "routes"
---
        def index
            render json: Route.all, status: :ok

INSERT INTO "routes" ("admin_id", "from", "to", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["admin_id", 7], ["from", "Homabay"], ["to", "Bondo"], ["price", "1500"], ["created_at", "2023-01-16 13:33:11.132499"], ["updated_at", "2023-01-16 13:33:11.132499"]]
---
        def create
            route = Route.create!(route_params)

SELECT "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "routes" SET "from" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["from", "Nairobi"], ["updated_at", "2023-01-16 15:32:54.502535"], ["id", 11]]
---
        def update
            route = Route.find_by(id: params[:id])
            route.update!(route_params)

SELECT "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "routes" WHERE "routes"."id" = ?  [["id", 10]]
---
        def destroy
            route = Route.find(params[:id])
            route.destroy

SELECT "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
        def show
            route = Route.find_by(id: params[:id])